<template>
  <div :style="{ ...getNodeBorder() }" class="box">
    <div :style="{ ...getNodeHeader() }" class="header">
      <div class="title" :title="nodeData.nodeName">
        <span style="vertical-align: middle" v-if="nodeData.oType == '0' || !nodeData.oType">
          <svg t="1742869057648" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3232" width="18" height="18"><path d="M441.5 823.7v69c0 19.1-15.5 34.5-34.5 34.5-19.1 0-34.5-15.5-34.5-34.5v-69h-69c-57.2 0-103.6-46.4-103.6-103.6V616.6h-69c-19.1 0-34.5-15.5-34.5-34.5 0-19.1 15.5-34.5 34.5-34.5h69V444h-69c-12.3 0-23.7-6.6-29.9-17.3-6.2-10.7-6.2-23.8 0-34.5s17.6-17.3 29.9-17.3h69v-69c0-57.2 46.4-103.6 103.6-103.6h69v-69c0-12.3 6.6-23.7 17.3-29.9 10.7-6.2 23.8-6.2 34.5 0s17.3 17.6 17.3 29.9v69h138.1v-69c0-19.1 15.5-34.5 34.5-34.5s34.5 15.5 34.5 34.5v69h69c57.2 0 103.6 46.4 103.6 103.6v69h69c19.1 0 34.5 15.5 34.5 34.5 0 19.1-15.5 34.5-34.5 34.5h-69v103.6h69c19.1 0 34.5 15.5 34.5 34.5 0 19.1-15.5 34.5-34.5 34.5h-69v103.6c0 57.2-46.4 103.6-103.6 103.6h-69v69c0 19.1-15.5 34.5-34.5 34.5s-34.5-15.5-34.5-34.5v-69H441.5z m276.2-552.3H303.4c-17.5 0-32.2 13.1-34.3 30.5l-0.2 4v414.3c0 17.5 13.1 32.2 30.5 34.3l4 0.2h414.3c17.5 0 32.2-13.1 34.3-30.5l0.2-4V305.9c0-19.1-15.4-34.5-34.5-34.5z" fill="#ffffff" p-id="3233"></path><path d="M549.2 641.4m-26.8 0a26.8 26.8 0 1 0 53.6 0 26.8 26.8 0 1 0-53.6 0Z" fill="#ffffff" p-id="3234"></path><path d="M625.1 641.4m-26.8 0a26.8 26.8 0 1 0 53.6 0 26.8 26.8 0 1 0-53.6 0Z" fill="#ffffff" p-id="3235"></path><path d="M701.1 641.4m-26.8 0a26.8 26.8 0 1 0 53.6 0 26.8 26.8 0 1 0-53.6 0Z" fill="#ffffff" p-id="3236"></path><path d="M315.9 517.5l20.5-25c10.8 9.2 24.8 15.5 36.8 15.5 13.4 0 19.7-5.1 19.7-13.2 0-8.7-8.3-11.6-21.4-17.1l-19.3-8.1c-15.9-6.3-30.7-19.5-30.7-41.5 0-25.4 22.8-45.8 54.9-45.8 17.5 0 36 6.7 49.2 19.9L407.7 425c-10-7.5-19.3-11.6-31.1-11.6-11.2 0-18.1 4.5-18.1 12.6 0 8.3 9.6 11.6 23 16.9l18.9 7.5c18.7 7.5 29.9 20.1 29.9 41.5 0 25.2-21.2 47.4-57.8 47.4-19.8 0-40.9-7.3-56.6-21.8zM595.8 574.1c-5.7 3.1-15.5 5.1-27.5 5.1-33 0-55.9-17.3-66.9-41.5-32.1-7.1-52.9-35-52.9-77.7 0-49.6 28.1-77.7 69.4-77.7 41.3 0 69.4 28.3 69.4 77.7 0 40.3-18.5 67.5-47.6 76.3 6.9 10.4 20.5 14.2 32.7 14.2 6.5 0 12.4-1.2 17.1-2.8l6.3 26.4z m-77.9-64.5c19.9 0 32.3-18.1 32.3-49.6 0-29.3-12.4-46.6-32.3-46.6s-32.1 17.3-32.1 46.6c0 31.5 12.2 49.6 32.1 49.6zM615.3 385.1h36.4v120.8h58.8v30.5h-95.2V385.1z" fill="#ffffff" p-id="3237"></path></svg>
        </span>
        <span style="vertical-align: middle" v-if="nodeData.oType == '1'">
          <svg t="1743495707627" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5362" width="16" height="16"><path d="M64 223.995h168.001v47.998c0 26.429 18.879 47.998 41.984 47.998h140.037c23.096 0 41.984-21.57 41.984-47.998v-47.998h504.003a32.005 32.005 0 0 0 0-64.009H455.997v-47.998c0-26.428-18.88-47.997-41.984-47.997H273.985c-23.096 0-41.984 21.569-41.984 47.997v47.998H64a32.005 32.005 0 0 0 0 64.01zM288.005 128h111.997v128H288.005V128zM960 479.995H791.999v-47.997c0-26.373-18.879-47.998-41.984-47.998H609.978c-23.096 0-41.984 21.634-41.984 47.998v47.997H64a32.005 32.005 0 0 0 0 64.01h504.003v47.997c0 26.364 18.88 47.998 41.984 47.998h140.037c23.096 0 41.984-21.634 41.984-47.998v-47.997H960.01a32.005 32.005 0 1 0-0.009-64.01zM735.995 576H623.998V448h111.997v128zM960 800.293v-0.288H455.997v-47.998c0-26.363-18.88-47.998-41.984-47.998H274.05c-23.105 0-41.984 21.635-41.984 47.998v47.998H64v0.288a32.005 32.005 0 0 0 0 64.01c0.987 0 1.918-0.196 2.886-0.289H232v47.998c0 26.363 18.879 47.997 41.984 47.997h140.037c23.096 0 41.984-21.634 41.984-47.997v-47.998h501.108c0.968 0.093 1.9 0.289 2.895 0.289a32.005 32.005 0 1 0-0.009-64.01zM400.002 896H288.005V768h111.997v128z" p-id="5363" fill="#ffffff"></path></svg> 
        </span>
        <span style="white-space: nowrap;text-overflow: ellipsis; overflow: hidden; width: 20px; font-size: 14px;">{{ nodeData.code }}</span>
      </div>
      <div event="edit"  title="修改当前节点" class="edit_node">
        <svg t="1742865827867" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2323" width="16" height="16"><path d="M358.165868 554.624796c-0.533143 0.680499-1.066285 1.391696-1.303692 2.251274l-41.104163 150.700257c-2.400676 8.772804 0.059352 18.226107 6.550183 24.892947 4.860704 4.742001 11.261485 7.350408 18.077727 7.350408 2.252297 0 4.504594-0.267083 6.727215-0.860601l149.630902-40.808428c0.23843 0 0.357134 0.207731 0.534166 0.207731 1.718131 0 3.408633-0.62217 4.683672-1.927909l400.113747-400.054395c11.883655-11.897981 18.404162-28.109198 18.404162-45.74281 0-19.989263-8.476045-39.963177-23.324218-54.767348l-37.786605-37.844933c-14.81645-14.848173-34.822087-23.338544-54.797024-23.338544-17.631566 0-33.842783 6.520507-45.75816 18.388812L358.758362 553.232077C358.344946 553.615816 358.462626 554.179658 358.165868 554.624796M862.924953 257.19778l-39.742143 39.71349-64.428382-65.451688 39.180348-39.179324c6.193049-6.222725 18.194384-5.318122 25.308409 1.822508l37.813211 37.845956c3.943822 3.941775 6.195096 9.18622 6.195096 14.372336C867.223862 250.574942 865.710392 254.42769 862.924953 257.19778M429.322487 560.907896l288.712541-288.728914 64.459081 65.49569L494.314711 625.838721 429.322487 560.907896zM376.718409 677.970032l20.863167-76.580143 55.656601 55.657624L376.718409 677.970032z" fill="#ffffff" p-id="2324"></path><path d="M888.265084 415.735539c-15.144932 0-27.562752 12.313443-27.620058 27.665083l0 372.98283c0 19.559475-15.885805 35.444257-35.475979 35.444257L194.220958 851.827709c-19.559475 0-35.504632-15.883759-35.504632-35.444257L158.716326 207.602222c0-19.575848 15.945157-35.474956 35.504632-35.474956l406.367171 0c15.231913 0 27.592428-12.371772 27.592428-27.606755 0-15.202237-12.360516-27.590382-27.592428-27.590382L190.013123 116.930129c-47.684022 0-86.49291 38.779212-86.49291 86.49291L103.520213 820.59231c0 47.713698 38.808888 86.47756 86.49291 86.47756l639.334083 0c47.715745 0 86.509283-38.763862 86.509283-86.47756L915.856489 443.222567C915.794068 428.048983 903.408993 415.735539 888.265084 415.735539" fill="#ffffff" p-id="2325"></path></svg>
      </div>
    </div>

    <div class="content" :title="nodeData.note">{{nodeData.nodeName}}<br>{{ nodeData.note }}</div>
    <div event="add" title="向前添加节点" class="add_node">+</div>
    <div event="delete" title="删除当前节点" class="delete_node">×</div>
  </div>
</template>

<script setup>
import { inject, ref } from 'vue'

let getNode = inject('getNode')
let nodeData = ref({})
let node = getNode()
nodeData.value = node.data



// 获取节点顶部样式
function getNodeHeader() {
  if(nodeData.value.oType == '0'){
    return {
      backgroundColor: 'rgb(135, 206, 250)'
    }
  } else  if(nodeData.value.oType == '1'){
    return {
      backgroundColor: 'rgb(16, 78, 139)'
    }
  }else{
    return {
      backgroundColor: 'rgb(121.3, 187.1, 255)'
    }
  }

}

// 获取节点顶部样式
function getNodeBorder() {
  return {}
}

node.on('change:data', res => {
  nodeData.value = res.current
})

</script>

<style lang="scss" scoped>
.box {
  width: 100%;
  height: 100%;
  position: relative;
  background: #fff;
  box-shadow: 0 0 5px #ccc;
  border-radius: 5px;
  &:hover {
    .delete_node {
      display: block;
    }
  }
  .header {
    height: 25px;
    background: #63a0e9;
    padding-right: 15px;
    position: relative;

    .title {
      color: #fff;
      line-height: 25px;
      font-weight: 500;
      overflow: hidden;
      margin-left: 2px;
      max-height: 25px;
    }
  }

  .content {
    padding: 3px;
    overflow: hidden;
    line-height: 15px;
    max-height: 45px;
    font-size: 12px;
  }
}

.edit_node {
  position: absolute;
  right: 0;
  top: 0;
  width: 20px;
  height: 25px;
  line-height: 25px;
  color: #fff;
  cursor: pointer;
  text-align: center;
  font-size: 18px;
  font-weight: 600;
}
.add_node {
  position: absolute;
  bottom: -28px;
  left: 50%;
  margin-left: -10px;
  height: 20px;
  width: 20px;
  background: #fff;
  box-shadow: 0px 0px 2px #63a0e9;
  border-radius: 20px;
  color: #63a0e9;
  line-height: 1;
  border: 1px solid #63a0e9;
  box-sizing: border-box;
  cursor: pointer;
  font-size: 18px;
  text-align: center;
  font-weight: 600;
}

.delete_node {
  display: none;
  position: absolute;
  top: 40px;
  right: 5px;
  background: #ccc;
  width: 20px;
  height: 20px;
  font-weight: 600;
  line-height: 1;
  color: #fff;
  text-align: center;
  cursor: pointer;
  font-size: 18px;
  border-radius: 20px;
  // display: block;
  &:hover {
    background: #63a0e9;
  }
}

</style>
